
&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.Тип.ЮридическоеЛицо") Тогда
		Элементы.КПП.Видимость=Истина;
	ИначеЕсли
		Объект.Тип = ПредопределенноеЗначение("Перечисление.Тип.ФизическоеЛицо") Тогда
		Элементы.КПП.Видимость=Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.КПП.Видимость=Истина;
КонецПроцедуры 


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Не ЗапретНаРасшифровкуНаименования Тогда 
		ТекстРасшифровки = РасшифровкаОПФНаименования(Объект.Наименование);
		Объект.ПолноеНаименование = ТекстРасшифровки; 
	КонецЕсли;	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Функция РасшифровкаОПФНаименования(Наименование)
	СловаНаименования = Строка(Наименование);
	МассивНаименование = СтрРазделить(СловаНаименования," ");
	РасшифровкаОПФ = Новый Соответствие;
	РасшифровкаОПФ.Вставить("ИП", "Индивидуальный предприниматель");
	РасшифровкаОПФ.Вставить("АО", "Акционерное общество");
	РасшифровкаОПФ.Вставить("ПАО", "Публичное акционерное общество");
	РасшифровкаОПФ.Вставить("ООО", "Общество с ограниченной ответственностью");
	РасшифровкаОПФ.Вставить("ЗАО", "Закрытое акционерное общество"); 
	
	МассивНаименованийНовый = Новый Массив;
	Для Каждого Слово Из МассивНаименование Цикл
		ЗначениеСоответствия = РасшифровкаОПФ.Получить(Слово);
		Если ЗначениеСоответствия = Неопределено Тогда
			МассивНаименованийНовый.Добавить(Слово);
		Иначе
			МассивНаименованийНовый.Добавить(ЗначениеСоответствия);
		КонецЕсли;
	КонецЦикла;
	ТекстРасшифровки = СтрСоединить (МассивНаименованийНовый, " ");
	Возврат ТекстРасшифровки;	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ТекстОшибки = "";
	Если НЕ РаботаСИНН.ИННВерен(Объект.ИНН, Объект.Тип,ТекстОшибки) Тогда 
		Отказ = Истина;
		Сообщить (ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	Если РаботаСИНН.ИННВерен(Объект.ИНН, Объект.Тип) Тогда 
		Элементы.ИНН.ЦветТекста = Новый Цвет;
		Элементы.ОшибкаИНН.Видимость = Ложь;
		Элементы.ОшибкаИНН.Заголовок ="";
	Иначе 
		Элементы.ИНН.ЦветТекста = WebЦвета.Красный;
		Элементы.ОшибкаИНН.Видимость = Истина;
		Элементы.ОшибкаИНН.Заголовок ="";	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗапретНаРасшифровкуНаименования = ЗначениеЗаполнено(Объект.ПолноеНаименование) И РасшифровкаОПФНаименования(Объект.Наименование) <> Объект.ПолноеНаименование;
КонецПроцедуры


