
&НаСервере
Процедура ПересчитатьДокументыНаСервере()
	НачальнаяДата = Объект.ДатаНачалаПериода;
	КонечнаяДата = Объект.ДатаЗавершенияПериода;
	
	Выборка = Документы.ПоступлениеТоваровИУслуг.Выбрать(НачальнаяДата,КонечнаяДата);
	Пока Выборка.Следующий() Цикл 
		ДокументОбъект = Выборка.ПолучитьОбъект(); 
		Для Каждого СтрокаТовары Из ДокументОбъект.Товары Цикл 
			СтрокаТовары.Сумма = СтрокаТовары.Цена * СтрокаТовары.Количество;	
		КонецЦикла;
		Если ДокументОбъект.Проведен Тогда 
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли; 
		ДокументОбъект.Записать(РежимЗаписи);
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДокументы(Команда)
	ПересчитатьДокументыНаСервере();
КонецПроцедуры
