
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Тип = Перечисления.Тип.ЮридическоеЛицо;
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ЭтоЮридическоеЛицо = (Тип = ПредопределенноеЗначение("Перечисление.Тип.ЮридическоеЛицо"));
	ЭтоФизическоеЛицо = (Тип = ПредопределенноеЗначение("Перечисление.Тип.ФизическоеЛицо"));
	Если ЭтоЮридическоеЛицо Тогда
		Если ЗначениеЗаполнено (ИНН) И ЗначениеЗаполнено (КПП) Тогда
			Если СтрДлина(ИНН)<> 10 ИЛИ СтрДлина (КПП) <> 9 Тогда
				Сообщить ("Некорректно заполнены ИНН или КПП!");
				Отказ = Истина;
			КонецЕсли;
		Иначе
			Сообщить ("Реквизиты ИНН или КПП не заполнены!");
			Отказ = Истина;
		КонецЕсли;
		Для Сч = 1 По СтрДлина (КПП) Цикл
			СимволКПП = Сред (КПП,Сч,1); 
			КодСимволаКПП = КодСимвола (СимволКПП);
			Если КодСимволаКПП <48 Или КодСимволаКпп> 57 Тогда
				Сообщить("Обнаружен запрещенный символ в КПП: "+ СимволКПП);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

