

Процедура ПриНачалеРаботыСистемы()
	
ДатаСегодня= ТекущаяДата();
ФорматДатыСегодня = Формат(ДатаСегодня,"ДФ=dd.MM.yy");
ДатаНачалаТекущегоДня = НачалоДня(ДатаСегодня);
Часов = 9;
Сдвиг = 9*60*60;
ДатаНачалаРабочегоДня = ДатаНачалаТекущегоДня + Сдвиг;
СколькоПрошлоСекунд = ТекущаяДата() - ДатаНачалаРабочегоДня;
СколькоПрошлоВМинутах=СколькоПрошлоСекунд / 60;
ЦелыеМинуты = Цел(СколькоПрошлоВМинутах);
ТекстСообщения = (СтрШаблон("%1:Сегодняшная дата; Начало рабочего дня начиняется:%3; %2: минут прошло  с начала рабочего дня", ФорматДатыСегодня, ЦелыеМинуты,Часов));
Сообщить(ТекстСообщения);	
	
	

КонецПроцедуры

