

&НаКлиенте
Процедура СписокГруппПриАктивизацииСтроки(Элемент)
	
	
	ПолеРодитель = Новый ПолеКомпоновкиДанных("Родитель");
	НайденныйЭлементОтбора = Неопределено;
	ЭлементыОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеРодитель Тогда
			НайденныйЭлементОтбора = ЭлементОтбора;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НайденныйЭлементОтбора = Неопределено Тогда
		НайденныйЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НайденныйЭлементОтбора.ЛевоеЗначение = ПолеРодитель;
		НайденныйЭлементОтбора.Использование = Истина;
		НайденныйЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	НайденныйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НайденныйЭлементОтбора.ПравоеЗначение = Элементы.СписокГрупп.ТекущаяСтрока;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборЦен()
	
	ПолеНоменклатура = Новый ПолеКомпоновкиДанных("Номенклатура");
	ВыбранноеЗначение = Элементы.Список.ТекущаяСтрока;
	РаботаСФормамиКлиент.УстановитьОтборВСписке(СписокЦен,ПолеНоменклатура, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("УстановитьОтборЦен", 0.1, Истина);
КонецПроцедуры
