
&НаКлиенте
Процедура Сохранить(Команда) 
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	ПриглашениеНаВечеринку = (Объект.Имя + Объект.ЧтоЕст + Объект.ЧтоПьет + Объект.БудетСНочевкой);
	Если Объект.БудетСНочевкой = Истина Тогда
		ТекстСообщения = (СтрШаблон("%1 Принял приглашение. %2 Ест. %3 Пьёт. Будет ночевать", Объект.Имя,Объект.ЧтоЕст, Объект.Чтопьет));
	ИначеЕсли 
		Объект.БудетСНочевкой = Ложь Тогда
		ТекстСообщения = (СтрШаблон("%1 принял приглашение. %2 Ест. %3 Пьёт. Не будет ночевать", Объект.Имя,Объект.ЧтоЕст, Объект.Чтопьет));
	КонецЕсли;
	ПоказатьПредупреждение(,ТекстСообщения,);
КонецПроцедуры
