
&НаКлиенте
Процедура Сохранить(Команда)
	Приглашение = (Объект.Имя + Объект.ЧтоЕст + Объект.ЧтоПьет + Объект.БудетСНочевкой); 	
	Если Объект.БудетСНочевкой = Истина  Тогда
		ТекстСообщения = СтрШаблон("%1 принял приглашение. %2 ест. %3 пьёт. Будет ночевать", Объект.Имя,Объект.ЧтоЕст, Объект.ЧтоПьет);
	ИначеЕсли 
		Объект.БудетСНочевкой = Ложь Тогда
		ТекстСообщения = СтрШаблон("%1 принял приглашение. %2 ест. %3 пьёт. Не будет ночевать", Объект.Имя,Объект.ЧтоЕст, Объект.Чтопьет);
	КонецЕсли;
	ПоказатьПредупреждение(,,,ТекстСообщения);
КонецПроцедуры
