

Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт
	
	ЮридическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
	ФактическийАдресКонтрагента = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
	ТелефонКонтрагента = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	EmailКонтрагента = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;
	
	Выборка = Справочники.Контрагенты.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		КонтрагентОбъект = Выборка.ПолучитьОбъект();
		КонтрагентОбъект.КонтактнаяИнформация.Очистить();
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьЮридическийАдрес) Тогда
			НоваяСтрока = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Вид = ЮридическийАдресКонтрагента;
			НоваяСтрока.Значение = КонтрагентОбъект.УдалитьЮридическийАдрес;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьФактическийАдрес) Тогда
			НоваяСтрока = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Вид = ФактическийАдресКонтрагента;
			НоваяСтрока.Значение = КонтрагентОбъект.УдалитьФактическийАдрес;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьEmail) Тогда
			НоваяСтрока = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Вид = EmailКонтрагента;
			НоваяСтрока.Значение = КонтрагентОбъект.УдалитьEmail;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КонтрагентОбъект.УдалитьТелефон) Тогда
			НоваяСтрока = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Вид = ТелефонКонтрагента;
			НоваяСтрока.Значение = КонтрагентОбъект.УдалитьТелефон;
		КонецЕсли;
		КонтрагентОбъект.Записать();
	КонецЦикла;
	
	
КонецПроцедуры