
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТекущийСотрудник = ПараметрыСеанса.ТекущийСотрудник;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.Ответственный = ТекущийСотрудник;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	ТекущийСотрудник = ПараметрыСеанса.ТекущийСотрудник;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.Ответственный) Тогда
			Запись.Ответственный = ТекущийСотрудник;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


