
&НаКлиенте
Процедура Сложить(Команда)
	Результат = Результат + Значение;
КонецПроцедуры

&НаКлиенте
Процедура Вычесть(Команда)
	Результат = Результат - Значение;
КонецПроцедуры

&НаКлиенте
Процедура Разделить(Команда)
	Результат = Результат / Значение;
КонецПроцедуры

&НаКлиенте
Процедура Умножить(Команда)
	Результат = Результат * Значение;
КонецПроцедуры

&НаКлиенте
Процедура ОбменятьЗначениеРезультат(Команда)
	ЗначениеОбмени= Значение;
	Значение = Результат;
	Результат = ЗначениеОбмени;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРезультатКПамяти(Команда)
	Память = Память + Результат;
КонецПроцедуры

&НаКлиенте
Процедура ВычестьРезультатИзПамяти(Команда)
	Память = Память - Результат;
КонецПроцедуры

&НаКлиенте
Процедура ПамятьВЗначение(Команда) 
	ВременПерем = Значение;
	Память= Результат;
	Значение = Память;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПамять(Команда)
	Память = 0;
КонецПроцедуры
