
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ТаблицаДляПроведения = ПереченьОборудования.Выгрузить();
	ТаблицаДляПроведения.Свернуть("Оборудование, СрокГодности", "Количество, Сумма");
	СостояниеНаСкладе = Перечисления.СостояниеОборудования.НаСкладе; 
	
	Движения.ОборудованиеОрганизации.Записывать = Истина;
	Для Каждого Строка Из ТаблицаДляПроведения Цикл
	Движение = Движения.ОборудованиеОрганизации.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.СостояниеОборудования = СостояниеНаСкладе;
	Движение.Оборудование = Строка.Оборудование;
	Движение.ГоденДо = ДобавитьМесяц(Дата, Строка.СрокГодности);
	Движение.Количество = Строка.Количество;
	Движение.Сумма = Строка.Сумма;
		КонецЦикла;
	
	
КонецПроцедуры
