
&НаСервере
Процедура СоздатьКонтрагентаНаСервере()
	НовыйОбъект = Справочники.Контрагенты.СоздатьЭлемент(); 
	НовыйОбъект.Заполнить(Неопределено);
	НовыйОбъект.Наименование = "АО Сигма"; 
	НовыйОбъект.ИНН = "1234567894";
	НовыйОбъект.КПП = "123456789";
	НовыйОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтрагента(Команда)
	СоздатьКонтрагентаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументНаСервере()
	НовыйОбъект = Документы.Событие.СоздатьДокумент();
	НовыйОбъект.Дата = ТекущаяДата();
	НовыйОбъект.Содержание = "Создан програмно";
	НовыйОбъект.ТипСобытия = Перечисления.ТипыСобытий.Встреча;
	НовыйОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	СоздатьДокументНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьКонтрагентаИСобытияНаСервере()
	НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент(); 
	НовКонтрагент.Заполнить(Неопределено);
	НовКонтрагент.Наименование = "ЗАО Моно"; 
	НовКонтрагент.ИНН = "5359486694";
	НовКонтрагент.КПП = "069043520";
	НовКонтрагент.Записать();	   
	
	НовДокумент = Документы.Событие.СоздатьДокумент();
	НовДокумент.Дата = ТекущаяДата();
	НовДокумент.Содержание = "Создан програмно";
	НовДокумент.ТипСобытия = Перечисления.ТипыСобытий.Встреча; 
	НовДокумент.Контрагент = НовКонтрагент.Ссылка;
	НовДокумент.Записать();
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтрагентаИСобытия(Команда)
	СоздатьКонтрагентаИСобытияНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьОкладНаСервере()
	СотрудникОбъект = СотрудникСсылка.ПолучитьОбъект ();
	СотрудникОбъект.Оклад = 100000;
	СотрудникОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОклад(Команда)
	УстановитьОкладНаСервере();
КонецПроцедуры

&НаСервере
Процедура УвеличитьНа10НаСервере()
	ДокументОбъект = СсылкаНаРеализацию.ПолучитьОбъект();
	Для Каждого СтрокаТЧ Из ДокументОбъект.Товары Цикл
		СтрокаТЧ.Цена = СтрокаТЧ.Цена * 1.1;
		СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;	
	КонецЦикла;
	ДокументОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьНа10(Команда)
	УвеличитьНа10НаСервере();
КонецПроцедуры

&НаСервере
Процедура СообщитьИНННаСервере()
	СсылкаНаКонтрагента = Справочники.Контрагенты.НайтиПоНаименованию(НаименованиеКонтрагента);
	Если СсылкаНаКонтрагента = Справочники.Контрагенты.ПустаяСсылка()Тогда 
		Сообщить("Контрагент не найден");
		Возврат;
	КонецЕсли;
	Сообщить(СсылкаНаКонтрагента.ИНН);
КонецПроцедуры

&НаКлиенте
Процедура СообщитьИНН(Команда)
	СообщитьИНННаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбратьСотрудниковСПустымОкладомНаСервере()
	ОтборСотрудников = Новый Структура;
	ОтборСотрудников.Вставить("Оклад", 0);
	Выборка = Справочники.Сотрудники.Выбрать(,,ОтборСотрудников);
	Пока Выборка.Следующий() Цикл
		Сообщить (Выборка.Наименование);
		СотрудникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СотрудникОбъект.Оклад = 100000;
		СотрудникОбъект.Записать();	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСотрудниковСПустымОкладом(Команда)
	ВыбратьСотрудниковСПустымОкладомНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьСотрудникаНаСервере()
	МассивСоСсылкой = Новый Массив;
	МассивСоСсылкой.Добавить(СотрудникСсылка);
	ТаблицаСсылок = НайтиПоСсылкам (МассивСоСсылкой);
	Если ТаблицаСсылок.Количество() = 0 Тогда
		СотрудникОбъект = СотрудникСсылка.ПолучитьОбъект();
		СотрудникОбъект.Удалить();
	Иначе 
		Сообщить (СтрШаблон ("Нельзя удалить объект %1. Использован в:",СотрудникСсылка));
		Для Каждого Строка Из ТаблицаСсылок Цикл
			Сообщить (Строка.Данные);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСотрудника(Команда)
	УдалитьСотрудникаНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуНаУдаленияНаСервере()
	СотрудникОбъект = СотрудникСсылка.ПолучитьОбъект();
	СотрудникОбъект.УстановитьПометкуУдаления(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуНаУдаления(Команда)
	УстановитьПометкуНаУдаленияНаСервере();
КонецПроцедуры
