
&НаКлиенте
Процедура ПоказатьСкрытьПароль(Команда)
	Элементы.Пароль.РежимПароля = Не Элементы.Пароль.РежимПароля;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Пользователь =
	ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	Если Пользователь = Неопределено И ВходРазрешен И ЗначениеЗаполнено(ИмяДляВхода) Тогда 
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.АутентификацияСтандартная = ВходРазрешен;
		НовыйПользователь.Имя = ИмяДляВхода;
		НовыйПользователь.ПолноеИмя = ТекущийОбъект.Наименование;
		НовыйПользователь.Пароль = Пароль;
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
		НовыйПользователь.Записать();
		ТекущийОбъект.ИдентификаторПользователяИБ = НовыйПользователь.УникальныйИдентификатор; 
	ИначеЕсли Пользователь <> Неопределено Тогда
		Пользователь.Имя = ИмяДляВхода;
		Пользователь.ПолноеИмя = ТекущийОбъект.Наименование;
		Если Пароль <> "Установлен" Тогда
			Пользователь.Пароль = Пароль;
		КонецЕсли;
		Пользователь.АутентификацияСтандартная = ВходРазрешен; 
		Пользователь.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ЗначениеЗаполнено (ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
		Если Пользователь <> Неопределено Тогда 
			ИмяДляВхода = Пользователь.Имя;
			Если Пользователь.ПарольУстановлен Тогда 
				Пароль = "Установлен";
			КонецЕсли;
			ВходРазрешен = Пользователь.АутентификацияСтандартная;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СлучайныйПароль(Команда)
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Пароль = "";
	СимволыПароля = "qwertyuiopasdfghjklzxcvbnm!0123456789";
	Для Н = 1 по 8 Цикл
		Пароль = Пароль + Сред (СимволыПароля,
		ГСЧ.СлучайноеЧисло (1, СтрДлина (СимволыПароля)), 1);
	КонецЦикла;

КонецПроцедуры
