
&НаКлиенте
Процедура НайтиСлова(Команда) 
	ДлинаТекста = СтрРазделить(Объект.Текст, " .,!?:;()%" + Символы.ПС, Ложь);
	СамоеДлинноеСлово = Неопределено;
	СамоеКороткоеСлово = Неопределено;
	Для Каждого Слово Из ДлинаТекста Цикл 
		Если СамоеДлинноеСлово = Неопределено Или СтрДлина(СамоеДлинноеСлово) < СтрДлина(Слово) Тогда
			СамоеДлинноеСлово = Слово; 
		КонецЕсли;
		
		Если СамоеКороткоеСлово = Неопределено Или СтрДлина(СамоеКороткоеСлово) >  СтрДлина(Слово) Тогда
			СамоеКороткоеСлово = Слово;
		КонецЕсли;
	КонецЦикла; 
	
	Сообщить(СтрШаблон("Самое длинное слово: %1, а самое короткое слово: %2", СамоеДлинноеСлово, СамоеКороткоеСлово));
КонецПроцедуры
