
&НаКлиенте
Процедура СогласованоПриИзменении(Элемент)

	ДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьФормы()
		Если Объект.Согласовано = Истина Тогда
		Элементы.Дата.Доступность = Ложь;
		Элементы.Контрагент.Доступность = Ложь;
		Элементы.Согласовано.Доступность = Ложь;
		Элементы.Комментарий.Доступность = Ложь;
		Элементы.Ответственный.Доступность = Ложь;
		Элементы.ГруппаТовары.Доступность = Ложь;
	Иначе
		Элементы.Номер.Доступность = Истина;
		Элементы.Дата.Доступность = Истина;
		Элементы.Контрагент.Доступность = Истина;
		Элементы.Согласовано.Доступность = Истина;
		Элементы.Комментарий.Доступность = Истина;
		Элементы.ГруппаТовары.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступностьФормы();
	КонецПроцедуры
