Функция ИННВерен (ИНН, ТипКонтрагента, ТекстОшибки = "") Экспорт
	Если Не ЗначениеЗаполнено (ИНН)Тогда  
		Возврат Истина;
	КонецЕсли;	
	КорректнаяДлина = ПроверкаДлиныИНН(ТипКонтрагента);
	
	Если СтрДлина(ИНН) <> КорректнаяДлина Тогда 
		ТекстОшибки = СтрШаблон("Для типа %1 корректная длина %2",ТипКонтрагента,КорректнаяДлина);
		Возврат Ложь;
	КонецЕсли;	
	Если Не ТолькоЦифры(ИНН) Тогда
		ТекстОшибки = "В ИНН должны быть только цифры";
		Возврат Ложь;	
		
	КонецЕсли; 
	
	Если СтрДлина(ИНН) = 10 Тогда
		СтрокаМножителей = "2,4,10,3,5,9,4,6,8,0";
		КонтрольныйРазряд = КонтрольныйРазряд(ИНН, СтрокаМножителей); 
		Если Строка(КонтрольныйРазряд) <> Сред(ИНН, 10, 1) Тогда
			ТекстОшибки = "ИНН не прошел проверку на контрольный разряд";
			Возврат Ложь;	
		КонецЕсли;
	КонецЕсли;
	Если СтрДлина (ИНН)= 11 Тогда
		СтрокаМножителей = "7,2,4,10,3,5,9,4,6,8,0";
		КонтрольныйРазряд = КонтрольныйРазряд(ИНН, СтрокаМножителей);
		Если Строка(КонтрольныйРазряд) <> Сред(ИНН, 11, 1) Тогда
			ТекстОшибки = "ИНН не прошел проверку на контрольный разряд";
			Возврат Ложь;	
		КонецЕсли;
	ИначеЕсли СтрДлина (ИНН)= 12 Тогда
		СтрокаМножителей = "3,7,2,4,10,3,5,9,4,6,8,0";
		КонтрольныйРазряд = КонтрольныйРазряд(ИНН, СтрокаМножителей);
		Если Строка(КонтрольныйРазряд) <> Сред(ИНН, 12, 1) Тогда
			ТекстОшибки = "ИНН не прошел проверку на контрольный разряд";
			Возврат Ложь;	
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;	
КонецФункции

Функция КонтрольныйРазряд(Знач ИНН, Знач СтрокаМножителей)
	
	Перем КонтрольныйРазряд, Множители, Множитель, НомерСимвола, СимволИНН, СуммаКонтрольная;
	
	Множители = СтрРазделить(СтрокаМножителей, ",");
	СуммаКонтрольная = 0;
	Для НомерСимвола =1 По СтрДлина(ИНН) Цикл 
		СимволИНН = Сред(ИНН, НомерСимвола, 1);
		Множитель = Множители[НомерСимвола - 1];
		СуммаКонтрольная = СуммаКонтрольная + СимволИНН* Множитель;
	КонецЦикла;
	КонтрольныйРазряд = СуммаКонтрольная%11;
	Если КонтрольныйРазряд = 10 Тогда
		КонтрольныйРазряд = 0;	 
	КонецЕсли;
	Возврат КонтрольныйРазряд;
	
КонецФункции

Функция ТолькоЦифры(Знач ИНН)
	
	Перем НомерСимвола, СимволИНН, ТолькоЦифры, Цифры;
	
	ТолькоЦифры = Истина;
	Цифры = "1234567890";
	Для НомерСимвола = 1 по СтрДлина (ИНН) Цикл
		СимволИНН = Сред(ИНН, НомерСимвола,1);
		
		Если СтрНайти(Цифры,СимволИНН)= 0 Тогда
			ТолькоЦифры = Ложь;
			Прервать;	
		КонецЕсли;
	КонецЦикла;
	Возврат ТолькоЦифры;
	
КонецФункции

Функция ПроверкаДлиныИНН(Знач ТипКонтрагента)
	Перем КорректнаяДлина;
	Если ТипКонтрагента = ПредопределенноеЗначение("Перечисление.Тип.ЮридическоеЛицо") Тогда
		КорректнаяДлина = 10;
	Иначе
		КорректнаяДлина = 12;
	КонецЕсли;
	Возврат КорректнаяДлина;
	
КонецФункции

