
Процедура ФормированияВыбытияОборудования() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыбытиеОборудования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВыбытиеОборудования КАК ВыбытиеОборудования
	|ГДЕ
	|	ВыбытиеОборудования.Дата = &Дата
	|	И ВыбытиеОборудования.Проведен";
	
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Документ = Документы.ВыбытиеОборудования.СоздатьДокумент();
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры
