
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РассчитатьСуммуСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуСтроки();
КонецПроцедуры 

&НаКлиенте 
Процедура РассчитатьСуммуСтроки()
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
КонецПроцедуры


&НаКлиенте
Процедура СортироватьПоСумме(Команда)
	Если СортироватьПоВозрастанию Тогда 
		Объект.Товары.Сортировать("Сумма Возр");
	Иначе
		Объект.Товары.Сортировать("Сумма Убыв");
	КонецЕсли;
	СортироватьПоВозрастанию = Не СортироватьПоВозрастанию;
	
	ОбновитьКнопкуСортировки();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКнопкуСортировки()
	
	Если СортироватьПоВозрастанию Тогда
		Элементы.ТоварыСортироватьПоСумме.Заголовок = "Сортировать по сумме (убыв)";
		Элементы.ТоварыСортироватьПоСумме.Картинка = БиблиотекаКартинок.СортироватьСписокПоУбыванию;
	Иначе
		Элементы.ТоварыСортироватьПоСумме.Заголовок = "Сортировать по сумме (возр)"; 
		Элементы.ТоварыСортироватьПоСумме.Картинка = БиблиотекаКартинок.СортироватьСписокПоВозрастанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьКнопкуСортировки();
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораСписком", , Элементы.Товары);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыбранныеДанные Из ВыбранноеЗначение Цикл
		
		СтрокаТаблицы = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыбранныеДанные);
		
	КонецЦикла;
КонецПроцедуры


